laxmangordon/ECE3849/Labs/Lab_0/libraries/HAL_TM4C1294/pins.h
// pushbuttons
#define PUSH1      PJ_0
#define PUSH2      PJ_1
#define TEMPSENSOR 0

#define USR_SW1    PJ_0
#define USR_SW2    PJ_1
// pushbuttons end


//BOOSTERPACK Pinout
#if defined(BOOSTERPACK2)
//PushButtons
#define S1 PH_1
#define S2 PK_6
#define J433 S1
#define J432 S2
//Joystick
#define JS1 PA_0
#define JSX PD_2
#define JSY PK_1
#define HOR JSX
#define VER JSY
//Led RGB
#define RGB_R PK_4
#define RGB_G PK_5
#define RGB_B PM_0
#elif defined(BOOSTERPACK1)
//PushButtons
#define S1 PL_1
#define S2 PL_2
#define J433 S1
#define J432 S2
//Joystick
#define JS1 PC_6
#define JSX PE_4
#define JSY PE_3
#define HOR JSX
#define VER JSY
//Led RGB
#define RGB_R PK_4
#define RGB_G PK_5
#endif

#define A0  PE_3   /* X8_12 */
#define A1  PE_2   /* X8_10 */
#define A2  PE_1   /* X8_08 */
#define A3  PE_0   /* X8_06 */
#define A4  PD_7   /* X8_14 */
#define A5  PD_6   /* AIN5 */
#define A6  PD_5   /* X6_11 */
#define A7  PD_4   /* X6_09 */
#define A8  PE_5   /* X8_11 */
#define A9  PE_4   /* X8_03 */
#define A10 PB_4   /* X6_06 */
#define A11 PB_5   /* X6_08 */
#define A12 PD_3   /* X8_13 */
#define A13 PD_2   /* X6_03 */
#define A14 PD_1   /* X9_12 */
#define A15 PD_0   /* X9_14 */
#define A16 PK_0   /* X6_10 */
#define A17 PK_1   /* X6_12 */
#define A18 PK_2   /* X6_14 */
#define A19 PK_3   /* X6_16 */

/* pins defines by connector
   Using defines instead of 'static const uint8_t' re-uses correct 
   energia pin declares. Also checks that all Px_x are declared.
*/

//      X6_01 3.3v
//      X6_02 5v
#define X6_03 PD_2
//      X6_04 GND
#define X6_05 PP_0
#define X6_5  PP_0
#define X6_06 PB_4
#define X6_6  PB_4
#define X6_07 PP_1
#define X6_7  PP_1
#define X6_08 PB_5
#define X6_8  PB_5
#define X6_09 PA_0
#define X6_9  PA_0
#define X6_10 PK_0
#define X6_11 PA_1
#define X6_12 PK_1
#define X6_13 PQ_0
#define X6_14 PK_2
#define X6_15 PP_4
#define X6_16 PK_3
#define X6_17 PN_5
#define X6_18 PA_4
#define X6_19 PN_4
#define X6_20 PA_5

#define X7_01 PG_1
//      X7_02 GND
#define X7_03 PK_4
#define X7_3  PK_4
#define X7_04 PM_7
#define X7_4  PM_7
#define X7_05 PK_5
#define X7_5  PK_5
#define X7_06 PP_5
#define X7_6  PP_5
#define X7_07 PM_0
#define X7_7  PM_0
#define X7_08 PA_7
#define X7_8  PA_7
#define X7_09 PM_1
#define X7_9  PM_1
//      X7_10 RESET
#define X7_11 PM_2
#define X7_12 PQ_2
#define X7_13 PH_0
#define X7_14 PQ_3
#define X7_15 PH_1
#define X7_16 PP_3
#define X7_17 PK_6
#define X7_18 PQ_1
#define X7_19 PK_7
#define X7_20 PM_6

//      X8_01 3.3v
//      X8_02 5v
#define X8_03 PE_4
//      X8_04 GND
#define X8_05 PC_4
#define X8_5  PC_4
#define X8_06 PE_0
#define X8_6  PE_0
#define X8_7  PC_5
#define X8_7  PC_5
#define X8_08 PE_1
#define X8_8  PE_1
#define X8_09 PC_6
#define X8_9  PC_6
#define X8_10 PE_2
#define X8_11 PE_5
#define X8_12 PE_3
#define X8_13 PD_3
#define X8_14 PD_7
#define X8_15 PC_7
#define X8_16 PA_6
#define X8_17 PB_2
#define X8_18 PM_4
#define X8_19 PB_3
#define X8_20 PM_5

#define X9_01 PF_1
//      X9_02 GND
#define X9_03 PF_2
#define X9_3  PF_2
#define X9_04 PM_3
#define X9_4  PM_3
#define X9_05 PF_3
#define X9_5  PF_3
#define X9_06 PH_2
#define X9_6  PH_2
#define X9_07 PG_0
#define X9_7  PG_0
#define X9_08 PH_3
#define X9_8  PH_3
#define X9_09 PL_4
#define X9_9  PL_4
//      X9_10 RST
#define X9_11 PL_5
#define X9_12 PD_1
#define X9_13 PL_0
#define X9_14 PD_0
#define X9_15 PL_1
#define X9_16 PN_2
#define X9_17 PL_2
#define X9_18 PN_3
#define X9_19 PL_3
#define X9_20 PP_2


//      X11_01 3.3V
//      X11_02 5.0V
//      X11_03 GND
//      X11_04 GND
#define X11_05 PB_4
#define X11_5  PB_4
#define X11_06 PA_2
#define X11_6  PA_2
#define X11_07 PB_5
#define X11_7  PB_5
#define X11_08 PA_3
#define X11_8  PA_3
#define X11_09 PH_0
#define X11_9  PH_0
#define X11_10 PA_4
#define X11_11 PH_1
#define X11_12 PA_5
#define X11_13 PH_2
#define X11_14 PE_0
#define X11_15 PH_3
#define X11_16 PE_1
#define X11_17 PC_7
#define X11_18 PE_2
#define X11_19 PC_6
#define X11_20 PE_3
#define X11_21 PC_5
#define X11_22 PE_4
#define X11_23 PC_4
#define X11_24 PE_5
#define X11_25 PA_6
#define X11_26 PK_0
#define X11_27 PA_7
#define X11_28 PK_1
#define X11_29 PG_1
#define X11_30 PK_2
#define X11_31 PG_0
#define X11_32 PK_3
#define X11_33 PM_3
//      X11_34 VREF
//      X11_35 GND
//      X11_36 GND
#define X11_37 PM_2
#define X11_38 PD_5
#define X11_39 PM_1
#define X11_40 PD_4
#define X11_41 PM_0
#define X11_42 PD_7
#define X11_43 PL_0
#define X11_44 PD_6
#define X11_45 PL_1
#define X11_46 PD_3
#define X11_47 PL_2
#define X11_48 PD_1
#define X11_49 PL_3
#define X11_50 PD_0
#define X11_51 PQ_0
#define X11_52 PD_2
#define X11_53 PQ_1
#define X11_54 PP_0
#define X11_55 PQ_2
#define X11_56 PP_1
#define X11_57 PQ_3
#define X11_58 PB_0
#define X11_59 PK_7
//      TARGET_VBUS
#define X11_61 GND
#define X11_62 GND
#define X11_63 PK_6
#define X11_64 PF_4
#define X11_65 PL_4
#define X11_66 PF_0
#define X11_67 PB_2
#define X11_68 PF_1
#define X11_69 PB_3
#define X11_70 PF_2
#define X11_71 PP_2
#define X11_72 PF_3
#define X11_73 PP_3
#define X11_74 PA_0
#define X11_75 PK_5
#define X11_76 PA_1
#define X11_77 PK_4
#define X11_78 PP_4
#define X11_79 PL_5
#define X11_80 PP_5
#define X11_81 PN_4
#define X11_82 PJ_0
#define X11_83 PN_5
#define X11_84 PJ_1
#define X11_85 PN_0
#define X11_86 PM_7
#define X11_87 PN_1
#define X11_88 PM_6
#define X11_89 PN_2
#define X11_90 PM_5
#define X11_91 PN_3
#define X11_92 PM_4
#define X11_93 PQ_4
#define X11_99 PQ_40
//      X11_94 TARGET_RESET
//      X11_95 WAKE
//      X11_96 GND
//      X11_97 5.0V
//      X11_98 3.3V


//energia.h
#define NOT_A_PORT 0
#define NOT_A_PIN 0
#define NOT_ON_TIMER 0
#define NOT_ON_ADC 0x10


#define PA 1
#define PB 2
#define PC 3
#define PD 4
#define PE 5
#define PF 6
#define PG 7
#define PH 8
#define PJ 9
#define PK 10
#define PL 11
#define PM 12
#define PN 13
#define PP 14
#define PQ 15
#define PR 16
#define PS 17
#define PT 18

#define TIMA 0
#define TIMB 8

// end connector pin defines

// Mapa de índice de puerto (PA=1..PQ=15) a SYSCTL_PERIPH_GPIOx
// Devuelve 0 si el índice no corresponde a un puerto válido
static inline uint32_t sysctl_periph_for_port(uint8_t portIndex) {
    switch (portIndex) {
    case PA: return SYSCTL_PERIPH_GPIOA;
    case PB: return SYSCTL_PERIPH_GPIOB;
    case PC: return SYSCTL_PERIPH_GPIOC;
    case PD: return SYSCTL_PERIPH_GPIOD;
    case PE: return SYSCTL_PERIPH_GPIOE;
    case PF: return SYSCTL_PERIPH_GPIOF;
    case PG: return SYSCTL_PERIPH_GPIOG;
    case PH: return SYSCTL_PERIPH_GPIOH;
    case PJ: return SYSCTL_PERIPH_GPIOJ;
    case PK: return SYSCTL_PERIPH_GPIOK;
    case PL: return SYSCTL_PERIPH_GPIOL;
    case PM: return SYSCTL_PERIPH_GPIOM;
    case PN: return SYSCTL_PERIPH_GPION;
    case PP: return SYSCTL_PERIPH_GPIOP;
    case PQ: return SYSCTL_PERIPH_GPIOQ;
    default: return 0;
    }
}

