laxmangordon/ECE3849/Labs/Lab_0/libraries/HAL_TM4C1294/pins.h
#define NUM_PORTS 16
#define WIRE_INTERFACES_COUNT 4
#define SPI_INTERFACES_COUNT 4
const uint32_t port_to_base[] = {
    NOT_A_PORT,
    (uint32_t) GPIO_PORTA_BASE, // 1
    (uint32_t) GPIO_PORTB_BASE, // 2
    (uint32_t) GPIO_PORTC_BASE, // 3
    (uint32_t) GPIO_PORTD_BASE, // 4
    (uint32_t) GPIO_PORTE_BASE, // 5
    (uint32_t) GPIO_PORTF_BASE, // 6
    (uint32_t) GPIO_PORTG_BASE, // 7
    (uint32_t) GPIO_PORTH_BASE, // 8
    (uint32_t) GPIO_PORTJ_BASE, // 9
    (uint32_t) GPIO_PORTK_BASE, // 10
    (uint32_t) GPIO_PORTL_BASE, // 11
    (uint32_t) GPIO_PORTM_BASE, // 12
    (uint32_t) GPIO_PORTN_BASE, // 13
    (uint32_t) GPIO_PORTP_BASE, // 14
    (uint32_t) GPIO_PORTQ_BASE, // 15
};


const uint8_t digital_pin_to_port[]       = {
    NOT_A_PIN,      // dummy
    NOT_A_PIN,      // 01 - 3.3v       X8_01
    PE,             // 02 - PE_4       X8_03
    PC,             // 03 - PC_4       X8_05
    PC,             // 04 - PC_5       X8_07
    PC,             // 05 - PC_6       X8_09
    PE,             // 06 - PE_5       X8_11
    PD,             // 07 - PD_3       X8_13
    PC,             // 08 - PC_7       X8_15
    PB,             // 09 - PB_2       X8_17
    PB,             // 10 - PB_3       X8_19
    PP,             // 11 - PP_2       X9_20
    PN,             // 12 - PN_3       X9_18
    PN,             // 13 - PN_2       X9_16
    PD,             // 14 - PD_0       X9_14
    PD,             // 15 - PD_1       X9_12
    NOT_A_PIN,      // 16 - RST        X9_10
    PH,             // 17 - PH_3       X9_08
    PH,             // 18 - PH_2       X9_06
    PM,             // 19 - PM_3       X9_04
    NOT_A_PIN,      // 20 - GND        X9_02
    NOT_A_PIN,      // 21 - 5v         X8_02
    NOT_A_PIN,      // 22 - GND        X8_04
    PE,             // 23 - PE_0       X8_06
    PE,             // 24 - PE_1       X8_08
    PE,             // 25 - PE_2       X8_10
    PE,             // 26 - PE_3       X8_12
    PD,             // 27 - PD_7       X8_14
    PA,             // 28 - PA_6       X8_16
    PM,             // 29 - PM_4       X8_18
    PM,             // 30 - PM_5       X8_20
    PL,             // 31 - PL_3       X9_19
    PL,             // 32 - PL_2       X9_17
    PL,             // 33 - PL_1       X9_15
    PL,             // 34 - PL_0       X9_13
    PL,             // 35 - PL_5       X9_11
    PL,             // 36 - PL_4       X9_09
    PG,             // 37 - PG_0       X9_07
    PF,             // 38 - PF_3       X9_05
    PF,             // 39 - PF_2       X9_03
    PF,             // 40 - PF_1       X9_01
    NOT_A_PIN,      // 41 - 3.3v       X6_01
    PD,             // 42 - PD_2       X6_03
    PP,             // 43 - PP_0       X6_05
    PP,             // 44 - PP_1       X6_07
    PD,             // 45 - PD_4       X6_09
    PD,             // 46 - PD_5       X6_11
    PQ,             // 47 - PQ_0       X6_13
    PP,             // 48 - PP_4       X6_15
    PN,             // 49 - PN_5       X6_17
    PN,             // 50 - PN_4       X6_19
    PM,             // 51 - PM_6       X7_20
    PQ,             // 52 - PQ_1       X7_18
    PP,             // 53 - PP_3       X7_16
    PQ,             // 54 - PQ_3       X7_14
    PQ,             // 55 - PQ_2       X7_12
    NOT_A_PIN,      // 56 - RESET      X7_10
    PA,             // 57 - PA_7       X7_08
    PP,             // 58 - PP_5       X7_06
    PM,             // 59 - PM_7       X7_04
    NOT_A_PIN,      // 60 - GND        X7_02
    NOT_A_PIN,      // 61 - 5v         X6_02
    NOT_A_PIN,      // 62 - GND        X6_04
    PB,             // 63 - PB_4       X6_06
    PB,             // 64 - PB_5       X6_08
    PK,             // 65 - PK_0       X6_10
    PK,             // 66 - PK_1       X6_12
    PK,             // 67 - PK_2       X6_14
    PK,             // 68 - PK_3       X6_16
    PA,             // 69 - PA_4       X6_18
    PA,             // 70 - PA_5       X6_20
    PK,             // 71 - PK_7       X7_19
    PK,             // 72 - PK_6       X7_17
    PH,             // 73 - PH_1       X7_15
    PH,             // 74 - PH_0       X7_13
    PM,             // 75 - PM_2       X7_11
    PM,             // 76 - PM_1       X7_09
    PM,             // 77 - PM_0       X7_07
    PK,             // 78 - PK_5       X7_05
    PK,             // 79 - PK_4       X7_03
    PG,             // 80 - PG_1       X7_01
    PN,             // 81 - PN_1       LED1
    PN,             // 82 - PN_0       LED2
    PF,             // 83 - PF_4       LED3
    PF,             // 84 - PF_0       LED4
    PJ,             // 85 - PJ_0       USR_SW1
    PJ,             // 86 - PJ_1       USR_SW2
    PD,             // 87 - PD_6       AIN5
    PA,             // 88 - PA_0       JP4
    PA,             // 89 - PA_1       JP5
    PA,             // 90 - PA_2       X11_06
    PA,             // 91 - PA_3       X11_08
    PL,             // 92 - PL_6       unrouted
    PL,             // 93 - PL_7       unrouted
    PB,             // 94 - PB_0       X11_58
    PB,             // 95 - PB_1       unrouted
};


const uint8_t digital_pin_to_bit_mask[]   = {
    NOT_A_PIN,      // dummy
    NOT_A_PIN,      // 01 - 3.3v       X8_01
    BV(4),          // 02 - PE_4       X8_03
    BV(4),          // 03 - PC_4       X8_05
    BV(5),          // 04 - PC_5       X8_07
    BV(6),          // 05 - PC_6       X8_09
    BV(5),          // 06 - PE_5       X8_11
    BV(3),          // 07 - PD_3       X8_13
    BV(7),          // 08 - PC_7       X8_15
    BV(2),          // 09 - PB_2       X8_17
    BV(3),          // 10 - PB_3       X8_19
    BV(2),          // 11 - PP_2       X9_20
    BV(3),          // 12 - PN_3       X9_18
    BV(2),          // 13 - PN_2       X9_16
    BV(0),          // 14 - PD_0       X9_14
    BV(1),          // 15 - PD_1       X9_12
    NOT_A_PIN,      // 16 - RST        X9_10
    BV(3),          // 17 - PH_3       X9_08
    BV(2),          // 18 - PH_2       X9_06
    BV(3),          // 19 - PM_3       X9_04
    NOT_A_PIN,      // 20 - GND        X9_02
    NOT_A_PIN,      // 21 - 5v         X8_02
    NOT_A_PIN,      // 22 - GND        X8_04
    BV(0),          // 23 - PE_0       X8_06
    BV(1),          // 24 - PE_1       X8_08
    BV(2),          // 25 - PE_2       X8_10
    BV(3),          // 26 - PE_3       X8_12
    BV(7),          // 27 - PD_7       X8_14
    BV(6),          // 28 - PA_6       X8_16
    BV(4),          // 29 - PM_4       X8_18
    BV(5),          // 30 - PM_5       X8_20
    BV(3),          // 31 - PL_3       X9_19
    BV(2),          // 32 - PL_2       X9_17
    BV(1),          // 33 - PL_1       X9_15
    BV(0),          // 34 - PL_0       X9_13
    BV(5),          // 35 - PL_5       X9_11
    BV(4),          // 36 - PL_4       X9_09
    BV(0),          // 37 - PG_0       X9_07
    BV(3),          // 38 - PF_3       X9_05
    BV(2),          // 39 - PF_2       X9_03
    BV(1),          // 40 - PF_1       X9_01
    NOT_A_PIN,      // 41 - 3.3v       X6_01
    BV(2),          // 42 - PD_2       X6_03
    BV(0),          // 43 - PP_0       X6_05
    BV(1),          // 44 - PP_1       X6_07
    BV(4),          // 45 - PD_4       X6_09
    BV(5),          // 46 - PD_5       X6_11
    BV(0),          // 47 - PQ_0       X6_13
    BV(4),          // 48 - PP_4       X6_15
    BV(5),          // 49 - PN_5       X6_17
    BV(4),          // 50 - PN_4       X6_19
    BV(6),          // 51 - PM_6       X7_20
    BV(1),          // 52 - PQ_1       X7_18
    BV(3),          // 53 - PP_3       X7_16
    BV(3),          // 54 - PQ_3       X7_14
    BV(2),          // 55 - PQ_2       X7_12
    NOT_A_PIN,      // 56 - RESET      X7_10
    BV(7),          // 57 - PA_7       X7_08
    BV(5),          // 58 - PP_5       X7_06
    BV(7),          // 59 - PM_7       X7_04
    NOT_A_PIN,      // 60 - GND        X7_02
    NOT_A_PIN,      // 61 - 5v         X6_02
    NOT_A_PIN,      // 62 - GND        X6_04
    BV(4),          // 63 - PB_4       X6_06
    BV(5),          // 64 - PB_5       X6_08
    BV(0),          // 65 - PK_0       X6_10
    BV(1),          // 66 - PK_1       X6_12
    BV(2),          // 67 - PK_2       X6_14
    BV(3),          // 68 - PK_3       X6_16
    BV(4),          // 69 - PA_4       X6_18
    BV(5),          // 70 - PA_5       X6_20
    BV(7),          // 71 - PK_7       X7_19
    BV(6),          // 72 - PK_6       X7_17
    BV(1),          // 73 - PH_1       X7_15
    BV(0),          // 74 - PH_0       X7_13
    BV(2),          // 75 - PM_2       X7_11
    BV(1),          // 76 - PM_1       X7_09
    BV(0),          // 77 - PM_0       X7_07
    BV(5),          // 78 - PK_5       X7_05
    BV(4),          // 79 - PK_4       X7_03
    BV(1),          // 80 - PG_1       X7_01
    BV(1),          // 81 - PN_1       LED1
    BV(0),          // 82 - PN_0       LED2
    BV(4),          // 83 - PF_4       LED3
    BV(0),          // 84 - PF_0       LED4
    BV(0),          // 85 - PJ_0       USR_SW1
    BV(1),          // 86 - PJ_1       USR_SW2
    BV(6),          // 87 - PD_6       AIN5
    BV(0),          // 88 - PA_0       JP4
    BV(1),          // 89 - PA_1       JP5
    BV(2),          // 90 - PA_2       X11_06
    BV(3),          // 91 - PA_3       X11_08
    BV(6),          // 92 - PL_6       unrouted
    BV(7),          // 93 - PL_7       unrouted
    BV(0),          // 94 - PB_0       X11_58
    BV(1),          // 95 - PB_1       unrouted
};

const uint32_t digital_pin_to_analog_in[] = {
    ADC_CTL_TS,     // 00 - Temperature Sensor
    NOT_ON_ADC,     // 01 - 3.3v       X8_01
    ADC_CTL_CH9,    // 02 - PE_4       X8_03
    NOT_ON_ADC,     // 03 - PC_4       X8_05
    NOT_ON_ADC,     // 04 - PC_5       X8_07
    NOT_ON_ADC,     // 05 - PC_6       X8_09
    ADC_CTL_CH8,    // 06 - PE_5       X8_11
    ADC_CTL_CH12,   // 07 - PD_3       X8_13
    NOT_ON_ADC,     // 08 - PC_7       X8_15
    NOT_ON_ADC,     // 09 - PB_2       X8_17
    NOT_ON_ADC,     // 10 - PB_3       X8_19
    NOT_ON_ADC,     // 11 - PP_2       X9_20
    NOT_ON_ADC,     // 12 - PN_3       X9_18
    NOT_ON_ADC,     // 13 - PN_2       X9_16
    ADC_CTL_CH15,   // 14 - PD_0       X9_14
    ADC_CTL_CH14,   // 15 - PD_1       X9_12
    NOT_ON_ADC,     // 16 - RST        X9_10
    NOT_ON_ADC,     // 17 - PH_3       X9_08
    NOT_ON_ADC,     // 18 - PH_2       X9_06
    NOT_ON_ADC,     // 19 - PM_3       X9_04
    NOT_ON_ADC,     // 20 - GND        X9_02
    NOT_ON_ADC,     // 21 - 5v         X8_02
    NOT_ON_ADC,     // 22 - GND        X8_04
    ADC_CTL_CH3,    // 23 - PE_0       X8_06
    ADC_CTL_CH2,    // 24 - PE_1       X8_08
    ADC_CTL_CH1,    // 25 - PE_2       X8_10
    ADC_CTL_CH0,    // 26 - PE_3       X8_12
    ADC_CTL_CH4,    // 27 - PD_7       X8_14
    NOT_ON_ADC,     // 28 - PA_6       X8_16
    NOT_ON_ADC,     // 29 - PM_4       X8_18
    NOT_ON_ADC,     // 30 - PM_5       X8_20
    NOT_ON_ADC,     // 31 - PL_3       X9_19
    NOT_ON_ADC,     // 32 - PL_2       X9_17
    NOT_ON_ADC,     // 33 - PL_1       X9_15
    NOT_ON_ADC,     // 34 - PL_0       X9_13
    NOT_ON_ADC,     // 35 - PL_5       X9_11
    NOT_ON_ADC,     // 36 - PL_4       X9_09
    NOT_ON_ADC,     // 37 - PG_0       X9_07
    NOT_ON_ADC,     // 38 - PF_3       X9_05
    NOT_ON_ADC,     // 39 - PF_2       X9_03
    NOT_ON_ADC,     // 40 - PF_1       X9_01
    NOT_ON_ADC,     // 41 - 3.3v       X6_01
    ADC_CTL_CH13,   // 42 - PD_2       X6_03
    NOT_ON_ADC,     // 43 - PP_0       X6_05
    NOT_ON_ADC,     // 44 - PP_1       X6_07
    ADC_CTL_CH7,    // 45 - PD_4       X6_09
    ADC_CTL_CH6,    // 46 - PD_5       X6_11
    NOT_ON_ADC,     // 47 - PQ_0       X6_13
    NOT_ON_ADC,     // 48 - PP_4       X6_15
    NOT_ON_ADC,     // 49 - PN_5       X6_17
    NOT_ON_ADC,     // 50 - PN_4       X6_19
    NOT_ON_ADC,     // 51 - PM_6       X7_20
    NOT_ON_ADC,     // 52 - PQ_1       X7_18
    NOT_ON_ADC,     // 53 - PP_3       X7_16
    NOT_ON_ADC,     // 54 - PQ_3       X7_14
    NOT_ON_ADC,     // 55 - PQ_2       X7_12
    NOT_ON_ADC,     // 56 - RESET      X7_10
    NOT_ON_ADC,     // 57 - PA_7       X7_08
    NOT_ON_ADC,     // 58 - PP_5       X7_06
    NOT_ON_ADC,     // 59 - PM_7       X7_04
    NOT_ON_ADC,     // 60 - GND        X7_02
    NOT_ON_ADC,     // 61 - 5v         X6_02
    NOT_ON_ADC,     // 62 - GND        X6_04
    ADC_CTL_CH10,   // 63 - PB_4       X6_06
    ADC_CTL_CH11,   // 64 - PB_5       X6_08
    ADC_CTL_CH16,   // 65 - PK_0       X6_10
    ADC_CTL_CH17,   // 66 - PK_1       X6_12
    ADC_CTL_CH18,   // 67 - PK_2       X6_14
    ADC_CTL_CH19,   // 68 - PK_3       X6_16
    NOT_ON_ADC,     // 69 - PA_4       X6_18
    NOT_ON_ADC,     // 70 - PA_5       X6_20
    NOT_ON_ADC,     // 71 - PK_7       X7_19
    NOT_ON_ADC,     // 72 - PK_6       X7_17
    NOT_ON_ADC,     // 73 - PH_1       X7_15
    NOT_ON_ADC,     // 74 - PH_0       X7_13
    NOT_ON_ADC,     // 75 - PM_2       X7_11
    NOT_ON_ADC,     // 76 - PM_1       X7_09
    NOT_ON_ADC,     // 77 - PM_0       X7_07
    NOT_ON_ADC,     // 78 - PK_5       X7_05
    NOT_ON_ADC,     // 79 - PK_4       X7_03
    NOT_ON_ADC,     // 80 - PG_1       X7_01
    NOT_ON_ADC,     // 81 - PN_1       LED1
    NOT_ON_ADC,     // 82 - PN_0       LED2
    NOT_ON_ADC,     // 83 - PF_4       LED3
    NOT_ON_ADC,     // 84 - PF_0       LED4
    NOT_ON_ADC,     // 85 - PJ_0       USR_SW1
    NOT_ON_ADC,     // 86 - PJ_1       USR_SW2
    ADC_CTL_CH5,    // 87 - PD_6       AIN5
    NOT_ON_ADC,     // 88 - PA_0       JP4
    NOT_ON_ADC,     // 89 - PA_1       JP5
    NOT_ON_ADC,     // 90 - PA_2       X11_06
    NOT_ON_ADC,     // 91 - PA_3       X11_08
    NOT_ON_ADC,     // 92 - PL_6       unrouted
    NOT_ON_ADC,     // 93 - PL_7       unrouted
    NOT_ON_ADC,     // 94 - PB_0       X11_58
    NOT_ON_ADC,     // 95 - PB_1       unrouted
};







#endif


